// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
//  Ввод чисел останавливается при помощи ввода стоп-слова "stop"
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 4

// string stop = "stop";
// string answer = "";
// int count = 0;
// for (int i = 0; answer != stop; i++)
// {

//     Console.WriteLine($"Введите :  ");

//     if (answer == stop)
//     {
//         break;
//     }
//     int test = Convert.ToInt32(answer);
//     if (test > 0)
//     {
//         count++;
//     }

// }
// void PrintArray (int[], collection)
// Console.WriteLine($"Вы ввели чисел больше нуля {count}");